multiregion/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.05 -0.05  -0.1)
    ( 0.05 -0.05  -0.1)
    ( 0.05  0.05  -0.1)
    (-0.05  0.05  -0.1)
    (-0.05 -0.05   0.1)
    ( 0.05 -0.05   0.1)
    ( 0.05  0.05   0.1)
    (-0.05  0.05   0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
     topwall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    leftwall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    rightwall
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    bottomwall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    frontface
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    backface
    {
        type wall;
        faces
        (
            (4 5 6 7)
        ); 
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
