multiregion/constant/heater/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/heater/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    heater_to_air
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          52;
        startFace       44;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_heater;
    }
    heater_to_bottomplate
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          4;
        startFace       96;
        sampleMode      nearestPatchFace;
        sampleRegion    bottomplate;
        samplePatch     bottomplate_to_heater;
    }
)

// ************************************************************************* //
