multiregion/0/heater/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/heater";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.01 0 0);

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    minX
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    maxX
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    minY
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    minZ
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    maxZ
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    heater_to_water
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
