multiregion/0/heater/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/heater";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform 100000;
    }
    minX
    {
        type            calculated;
        value           uniform 100000;
    }
    maxX
    {
        type            calculated;
        value           uniform 100000;
    }
    minY
    {
        type            calculated;
        value           uniform 100000;
    }
    minZ
    {
        type            calculated;
        value           uniform 100000;
    }
    maxZ
    {
        type            calculated;
        value           uniform 100000;
    }
    heater_to_water
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
