multiregion/0/air/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/water";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform 300;
    }
    maxX
    {
        type            calculated;
        value           uniform 300;
    }
    minZ
    {
        type            calculated;
        value           uniform 300;
    }
    maxZ
    {
        type            calculated;
        value           uniform 300;
    }
    water_to_heater
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
